app/controllers/articles_controller.rb

INSERT INTO "articles" ("subject", "target", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["subject", "deneme1212"], ["target", "deneme12121"], ["created_at", "2015-07-20 12:37:59.419341"], ["updated_at", "2015-07-20 12:37:59.419341"]]
---
def create
  @article = Article.new(article_params)

  if @article.save